-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\section_3-
> 2.log
  log type:  text
 opened on:  11 Mar 2023, 22:20:51

. 
. cd data
C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\data

. 
. import delimited "spec_1_stringency_CSSD_CSAD_updated_csi"
(encoding automatically selected: ISO-8859-1)
(6 vars, 733 obs)

. 
. sort date

. gen time=_n

. drop if time==1
(1 observation deleted)

. 
. replace stringency = 0 if missing(stringency) 
(0 real changes made)

. 
. tempvar PL75

. egen `PL75' = pctile(stringency), p(75)

. gen D25Upper = 0

. label var D25Upper "Dummy variable = 1 if stringency fall within upper 25%"

. replace D25Upper = 1 if stringency >= `PL75'
(295 real changes made)

. 
. tempvar PL90

. egen `PL90' = pctile(stringency), p(90)

. gen D10Upper = 0

. label var D10Upper "Dummy variable = 1 if stringency fall within upper 10%"

. replace D10Upper = 1 if stringency >= `PL90'
(158 real changes made)

. 
. tempvar PL95

. egen `PL95' = pctile(stringency), p(95)

. gen D5Upper = 0

. label var D5Upper "Dummy variable = 1 if stringency fall within upper 5%"

. replace D5Upper = 1 if stringency >= `PL95'
(46 real changes made)

. 
. gen r_m_sqr=r_m^2

. 
. tsset time

Time variable: time, 2 to 733
        Delta: 1 unit

. 
. estpost sum r_m - r_m_sqr

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
         r_m |       732        732  -.0205091   1.520264    1.23299  -8.977271   5.395286  -15.01269 
        csad |       732        732   1.516546   .1293076   .3595937   .7320971    2.92287   1110.111 
        cssd |       732        732   .1275852    .000829   .0287925   .0592159     .25052   93.39233 
  stringency |       732        732   69.82656   200.9026   14.17401          0      81.94   51113.04 
        time |       732        732      367.5      44713   211.4545          2        733     269010 
    __000000 |       732        732      78.24          0          0      78.24      78.24   57271.68 
    D25Upper |       732        732   .4030055   .2409212   .4908372          0          1        295 
    __000001 |       732        732      79.17          0          0      79.17      79.17   57952.44 
    D10Upper |       732        732    .215847   .1694886   .4116899          0          1        158 
    __000002 |       732        732      81.94          0          0      81.94      81.94   59980.08 
     D5Upper |       732        732   .0628415    .058973   .2428436          0          1         46 
     r_m_sqr |       732        732   1.518607    17.3855   4.169592   1.29e-06   80.59139   1111.621 

. 
. quietly reg cssd r_m r_m_sqr stringency

. estat bgodfrey, lags(1 2:30)

Breusch–Godfrey LM test for autocorrelation
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |        150.953               1                   0.0000
       2     |        198.597               2                   0.0000
       3     |        223.032               3                   0.0000
       4     |        232.522               4                   0.0000
       5     |        233.990               5                   0.0000
       6     |        234.241               6                   0.0000
       7     |        235.753               7                   0.0000
       8     |        236.156               8                   0.0000
       9     |        237.254               9                   0.0000
      10     |        239.629              10                   0.0000
      11     |        239.700              11                   0.0000
      12     |        241.615              12                   0.0000
      13     |        241.663              13                   0.0000
      14     |        242.293              14                   0.0000
      15     |        243.352              15                   0.0000
      16     |        244.150              16                   0.0000
      17     |        246.898              17                   0.0000
      18     |        248.401              18                   0.0000
      19     |        248.522              19                   0.0000
      20     |        249.569              20                   0.0000
      21     |        254.213              21                   0.0000
      22     |        254.216              22                   0.0000
      23     |        254.610              23                   0.0000
      24     |        255.030              24                   0.0000
      25     |        255.030              25                   0.0000
      26     |        259.830              26                   0.0000
      27     |        260.047              27                   0.0000
      28     |        260.060              28                   0.0000
      29     |        260.643              29                   0.0000
      30     |        260.675              30                   0.0000
---------------------------------------------------------------------------
                        H0: no serial correlation

. 
. dfuller cssd

Dickey–Fuller test for unit root          Number of obs  = 731
Variable: cssd                            Number of lags =   0

H0: Random walk without drift, d = 0

                                       Dickey–Fuller
                   Test      -------- critical value ---------
              statistic           1%           5%          10%
--------------------------------------------------------------
 Z(t)           -15.505       -3.430       -2.860       -2.570
--------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000.

. 
. newey cssd r_m r_m_sqr stringency, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  3,       728) =      11.17
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
        cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         r_m |   .0007975   .0008397     0.95   0.343    -.0008511    .0024461
     r_m_sqr |    .001255   .0003404     3.69   0.000     .0005866    .0019233
  stringency |   .0003841   .0000814     4.72   0.000     .0002243    .0005438
       _cons |   .0988787    .005632    17.56   0.000     .0878218    .1099357
------------------------------------------------------------------------------

. 
. newey cssd r_m c.r_m_sqr##D25Upper, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  4,       727) =      20.89
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------------
                   |             Newey–West
              cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               r_m |   .0006295   .0007841     0.80   0.422    -.0009098    .0021688
           r_m_sqr |     .00096   .0002306     4.16   0.000     .0005072    .0014128
        1.D25Upper |   .0074348   .0037533     1.98   0.048     .0000661    .0148035
                   |
D25Upper#c.r_m_sqr |
                1  |   .0009208    .000342     2.69   0.007     .0002495    .0015921
                   |
             _cons |   .1224959   .0024602    49.79   0.000      .117666    .1273257
------------------------------------------------------------------------------------

. newey cssd r_m c.r_m_sqr##D10Upper, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  4,       727) =      13.36
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------------
                   |             Newey–West
              cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               r_m |    .001035   .0008818     1.17   0.241    -.0006962    .0027662
           r_m_sqr |   .0011876   .0003502     3.39   0.001        .0005    .0018751
        1.D10Upper |  -.0045609   .0037577    -1.21   0.225    -.0119381    .0028163
                   |
D10Upper#c.r_m_sqr |
                1  |   .0009293     .00048     1.94   0.053    -.0000131    .0018718
                   |
             _cons |   .1264206   .0023478    53.85   0.000     .1218113    .1310299
------------------------------------------------------------------------------------

. newey cssd r_m c.r_m_sqr##D5Upper, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  4,       727) =       5.25
                                                Prob > F          =     0.0004

-----------------------------------------------------------------------------------
                  |             Newey–West
             cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
              r_m |   .0010164   .0008641     1.18   0.240      -.00068    .0027128
          r_m_sqr |   .0013545   .0003674     3.69   0.000     .0006332    .0020759
        1.D5Upper |  -.0017539   .0061527    -0.29   0.776     -.013833    .0103253
                  |
D5Upper#c.r_m_sqr |
               1  |  -.0028612   .0012971    -2.21   0.028    -.0054078   -.0003147
                  |
            _cons |   .1257921   .0021125    59.55   0.000     .1216447    .1299394
-----------------------------------------------------------------------------------

. 
. newey csad r_m r_m_sqr stringency, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  3,       728) =       9.55
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
        csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         r_m |   .0167532   .0125216     1.34   0.181    -.0078295     .041336
     r_m_sqr |   .0240484   .0076895     3.13   0.002     .0089521    .0391446
  stringency |   .0043471   .0010046     4.33   0.000     .0023749    .0063193
       _cons |   1.176826   .0683877    17.21   0.000     1.042565    1.311086
------------------------------------------------------------------------------

. 
. newey csad r_m c.r_m_sqr##D25Upper, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  4,       727) =      40.61
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------------
                   |             Newey–West
              csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               r_m |   .0130053   .0106198     1.22   0.221    -.0078439    .0338545
           r_m_sqr |   .0162981   .0052826     3.09   0.002     .0059271     .026669
        1.D25Upper |   .0601081   .0498203     1.21   0.228    -.0377007     .157917
                   |
D25Upper#c.r_m_sqr |
                1  |   .0233126   .0063951     3.65   0.000     .0107576    .0358677
                   |
             _cons |   1.451432   .0321524    45.14   0.000     1.388309    1.514554
------------------------------------------------------------------------------------

. newey csad r_m c.r_m_sqr##D10Upper, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  4,       727) =      27.73
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------------
                   |             Newey–West
              csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
               r_m |   .0203563   .0132319     1.54   0.124    -.0056211    .0463336
           r_m_sqr |    .021595   .0076933     2.81   0.005     .0064912    .0366988
        1.D10Upper |  -.0804083   .0476466    -1.69   0.092    -.1739497    .0131331
                   |
D10Upper#c.r_m_sqr |
                1  |   .0203261     .00904     2.25   0.025     .0025785    .0380737
                   |
             _cons |   1.493502   .0314267    47.52   0.000     1.431804      1.5552
------------------------------------------------------------------------------------

. newey csad r_m c.r_m_sqr##D5Upper, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  4,       727) =       5.05
                                                Prob > F          =     0.0005

-----------------------------------------------------------------------------------
                  |             Newey–West
             csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
              r_m |   .0189134   .0128756     1.47   0.142    -.0063645    .0441912
          r_m_sqr |   .0248658   .0079488     3.13   0.002     .0092604    .0404711
        1.D5Upper |  -.1085376   .0636912    -1.70   0.089    -.2335783     .016503
                  |
D5Upper#c.r_m_sqr |
               1  |  -.0254674   .0198251    -1.28   0.199    -.0643886    .0134538
                  |
            _cons |   1.487175   .0286768    51.86   0.000     1.430876    1.543475
-----------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\section_3-
> 2.log
  log type:  text
 closed on:  11 Mar 2023, 22:20:54
-----------------------------------------------------------------------------------------------------------------------------
