--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-
> of-Bristol---AED\section_3-2.log
  log type:  text
 opened on:  24 Mar 2023, 20:21:54

. 
. cd "C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bris
> tol---AED"
C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---
> AED

. 
. import delimited "./data/spec_1.csv"
(encoding automatically selected: ISO-8859-1)
(15 vars, 733 obs)

. 
. replace stringencyindex_weightedaverage = 0 if missing(stringencyindex_weightedaverage) 
(0 real changes made)

. 
. sort date

. drop if stringencyindex_weightedaverage==0
(19 observations deleted)

. gen time=_n

. 
. egen r_m_mean = mean(r_m)

. gen r_m_sqr= (r_m-r_m_mean)^2

. gen r_m_abs=abs(r_m)

. replace stringencyindex_weightedaverage=stringencyindex_weightedaverage/100
(714 real changes made)

. 
. la var r_m "Market Return"

. la var stringencyindex_weightedaverage "Stringency Index"

. la var c6e_stayathomerequirements "C6: Shelter in Place Indicator"

. la var populationvaccinated "Vaccination Rate"

. la var rolling_deaths "COVID-19 Deaths 7-Day Rolling Average"

. la var cases "COVID-19 Daily Cases"

. la var r_m_sqr "Market Return Squared"

. la var r_m_abs "Absolute Market Return"

. 
. tempvar PL75

. egen `PL75' = pctile(stringencyindex_weightedaverage), p(75)

. gen D25Upper = 0

. label var D25Upper "S upper 25%"

. replace D25Upper = 1 if stringencyindex_weightedaverage >= `PL75'
(295 real changes made)

. 
. tempvar PL90

. egen `PL90' = pctile(stringencyindex_weightedaverage), p(90)

. gen D10Upper = 0

. label var D10Upper "S upper 10%"

. replace D10Upper = 1 if stringencyindex_weightedaverage >= `PL90'
(158 real changes made)

. 
. tempvar PL95

. egen `PL95' = pctile(stringencyindex_weightedaverage), p(95)

. gen D5Upper = 0

. label var D5Upper "S upper 5%"

. replace D5Upper = 1 if stringencyindex_weightedaverage >= `PL95'
(46 real changes made)

. 
. tempvar C675

. egen `C675' = pctile(c6e_stayathomerequirements), p(75)

. gen days = 0

. label var days "Days"

. replace days = days[_n-1] + 1 if c6e_stayathomerequirements >= `C675'
(507 real changes made)

. replace days = 0 if c6e_stayathomerequirements < `C675'
(0 real changes made)

. 
. 
. tsset time

Time variable: time, 1 to 714
        Delta: 1 unit

. 
. outsheet csad cssd r_m r_m_abs r_m_sqr stringencyindex_weightedaverage c6e_stayathomerequirement
> s D25Upper D10Upper D5Upper days populationvaccinated rolling_deaths cases using ./data/spec_1_s
> tata.csv , comma replace

. 
. // Summary Stats //
. 
. estpost tabstat csad cssd r_m r_m_sqr stringencyindex_weightedaverage c6e_stayathomerequirements
>  days populationvaccinated rolling_deaths, c(stat) stat(sum mean sd min max n)

Summary statistics: sum mean sd min max count
     for variables: csad cssd r_m r_m_sqr stringencyindex_weightedaverage c6e_stayathomerequiremen
> ts days populationvaccinated rolling_deaths

             |    e(sum)    e(mean)      e(sd)     e(min)     e(max)   e(count) 
-------------+------------------------------------------------------------------
        csad |  1087.799   1.523529   .3599163   .7320971    2.92287        714 
        cssd |  91.46551    .128103   .0288556   .0592159     .25052        714 
         r_m | -17.28693  -.0242114   1.241874  -8.977271   5.395286        714 
     r_m_sqr |  1099.624    1.54009   4.199588   3.21e-08   80.15728        714 
stringency~e |  511.1304   .7158689   .0893202      .2639      .8194        714 
c6e_stayat~s |      1771   2.480392   .8911482          0          3        714 
        days |     23886   33.45378   37.57426          0        135        714 
population~d |  28220.54   39.52457   42.21818          0      89.35        714 
rolling_de~s |  27945.43   39.13926    99.6529          0   1294.571        714 

. esttab using ".\TeX_files\SummaryTable.tex", replace cells("sum(fmt(%6.0fc)) mean(fmt(%6.3fc)) s
> d(fmt(%6.3fc)) min(fmt(%6.3fc)) max(fmt(%6.3fc)) count") nonumber nomtitle nonote noobs label bo
> oktabs collabels("Sum" "Mean" "SD" "Min" "Max" "N")
(output written to .\TeX_files\SummaryTable.tex)

. 
. // t-tests //
. 
. quietly reg csad r_m_abs r_m_sqr stringencyindex_weightedaverage populationvaccinated rolling_de
> aths

. estat bgodfrey, lags(1 2:20)

Breusch–Godfrey LM test for autocorrelation
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |        221.811               1                   0.0000
       2     |        273.174               2                   0.0000
       3     |        280.670               3                   0.0000
       4     |        285.139               4                   0.0000
       5     |        286.493               5                   0.0000
       6     |        286.592               6                   0.0000
       7     |        287.010               7                   0.0000
       8     |        288.771               8                   0.0000
       9     |        288.871               9                   0.0000
      10     |        292.696              10                   0.0000
      11     |        292.812              11                   0.0000
      12     |        292.814              12                   0.0000
      13     |        292.959              13                   0.0000
      14     |        294.672              14                   0.0000
      15     |        294.774              15                   0.0000
      16     |        294.944              16                   0.0000
      17     |        295.088              17                   0.0000
      18     |        295.165              18                   0.0000
      19     |        295.802              19                   0.0000
      20     |        297.710              20                   0.0000
---------------------------------------------------------------------------
                        H0: no serial correlation

. dfuller csad

Dickey–Fuller test for unit root          Number of obs  = 713
Variable: csad                            Number of lags =   0

H0: Random walk without drift, d = 0

                                       Dickey–Fuller
                   Test      -------- critical value ---------
              statistic           1%           5%          10%
--------------------------------------------------------------
 Z(t)           -12.478       -3.430       -2.860       -2.570
--------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000.

. swilk csad

                   Shapiro–Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
        csad |        714    0.94971     23.349     7.693    0.00000

. 
. // Regressions //
. 
. eststo: newey csad r_m_abs r_m_sqr, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  2,       711) =      52.84
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
        csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     r_m_abs |   .1834082   .0249928     7.34   0.000     .1343397    .2324767
     r_m_sqr |  -.0093639   .0046221    -2.03   0.043    -.0184386   -.0002892
       _cons |   1.377245   .0261608    52.65   0.000     1.325883    1.428606
------------------------------------------------------------------------------
(est1 stored)

. eststo: newey csad r_m_abs r_m_sqr stringencyindex_weightedaverage populationvaccinated rolling_
> deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      30.20
                                                Prob > F          =     0.0000

-------------------------------------------------------------------------------------------------
                                |             Newey–West
                           csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------------+----------------------------------------------------------------
                        r_m_abs |   .1821381    .024369     7.47   0.000     .1342938    .2299823
                        r_m_sqr |  -.0099817   .0047032    -2.12   0.034    -.0192157   -.0007478
stringencyindex_weightedaverage |   .4226525   .2128959     1.99   0.048     .0046696    .8406353
           populationvaccinated |  -.0014912   .0005368    -2.78   0.006    -.0025451   -.0004373
                 rolling_deaths |  -.0003472    .000126    -2.76   0.006    -.0005945   -.0000999
                          _cons |   1.149271   .1521068     7.56   0.000     .8506367    1.447906
-------------------------------------------------------------------------------------------------
(est2 stored)

. eststo: newey csad r_m_abs r_m_sqr c.r_m_sqr#D25Upper populationvaccinated rolling_deaths, lag(5
> )

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      60.59
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .1631529   .0241265     6.76   0.000     .1157849    .2105208
             r_m_sqr |   -.010769   .0032116    -3.35   0.001    -.0170743   -.0044636
                     |
  D25Upper#c.r_m_sqr |
                  1  |   .0137681   .0051844     2.66   0.008     .0035895    .0239466
                     |
populationvaccinated |   -.001387   .0005366    -2.58   0.010    -.0024406   -.0003335
      rolling_deaths |  -.0004405   .0001188    -3.71   0.000    -.0006738   -.0002073
               _cons |   1.459276   .0336473    43.37   0.000     1.393215    1.525336
--------------------------------------------------------------------------------------
(est3 stored)

. eststo: newey csad r_m_abs r_m_sqr c.r_m_sqr#D10Upper populationvaccinated rolling_deaths, lag(5
> )

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      29.09
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .1805885   .0246395     7.33   0.000     .1322132    .2289637
             r_m_sqr |  -.0095441   .0046221    -2.06   0.039    -.0186187   -.0004694
                     |
  D10Upper#c.r_m_sqr |
                  1  |   .0018645   .0077562     0.24   0.810    -.0133633    .0170923
                     |
populationvaccinated |  -.0014422   .0005378    -2.68   0.007     -.002498   -.0003864
      rolling_deaths |  -.0004544   .0001206    -3.77   0.000    -.0006912   -.0002175
               _cons |   1.454026   .0333983    43.54   0.000     1.388455    1.519598
--------------------------------------------------------------------------------------
(est4 stored)

. eststo: newey csad r_m_abs r_m_sqr c.r_m_sqr#D5Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      30.70
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .1930655   .0242445     7.96   0.000     .1454658    .2406652
             r_m_sqr |  -.0109466   .0046013    -2.38   0.018    -.0199804   -.0019128
                     |
   D5Upper#c.r_m_sqr |
                  1  |  -.1084965   .0330793    -3.28   0.001    -.1734418   -.0435512
                     |
populationvaccinated |  -.0015452   .0005402    -2.86   0.004    -.0026059   -.0004845
      rolling_deaths |  -.0004606    .000122    -3.77   0.000    -.0007001    -.000221
               _cons |   1.455493   .0341134    42.67   0.000     1.388517    1.522468
--------------------------------------------------------------------------------------
(est5 stored)

. eststo: newey csad r_m_abs r_m_sqr c6e_stayathomerequirements days populationvaccinated rolling_
> deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  6,       707) =      25.29
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                           |             Newey–West
                      csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   r_m_abs |   .1828106   .0244426     7.48   0.000      .134822    .2307993
                   r_m_sqr |    -.01009   .0047586    -2.12   0.034    -.0194326   -.0007473
c6e_stayathomerequirements |   .0490714    .026134     1.88   0.061    -.0022382     .100381
                      days |   -.000553   .0006538    -0.85   0.398    -.0018367    .0007306
      populationvaccinated |  -.0012934   .0006285    -2.06   0.040    -.0025274   -.0000594
            rolling_deaths |  -.0003563   .0001243    -2.87   0.004    -.0006004   -.0001122
                     _cons |   1.340737    .064092    20.92   0.000     1.214904    1.466571
--------------------------------------------------------------------------------------------
(est6 stored)

. 
. 
. esttab, b(5) se(5) nomtitle label star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------------------------------------------------------------
> ------------------
                              (1)             (2)             (3)             (4)             (5) 
>             (6)   
--------------------------------------------------------------------------------------------------
> ------------------
Absolute Market Re~n      0.18341***      0.18214***      0.16315***      0.18059***      0.19307*
> **      0.18281***
                        (0.02499)       (0.02437)       (0.02413)       (0.02464)       (0.02424) 
>       (0.02444)   

Market Return Squa~d     -0.00936**      -0.00998**      -0.01077***     -0.00954**      -0.01095*
> *      -0.01009** 
                        (0.00462)       (0.00470)       (0.00321)       (0.00462)       (0.00460) 
>       (0.00476)   

Stringency Index                          0.42265**                                               
>                   
                                        (0.21290)                                                 
>                   

Vaccination Rate                         -0.00149***     -0.00139***     -0.00144***     -0.00155*
> **     -0.00129** 
                                        (0.00054)       (0.00054)       (0.00054)       (0.00054) 
>       (0.00063)   

COVID-19 Deaths 7-~v                     -0.00035***     -0.00044***     -0.00045***     -0.00046*
> **     -0.00036***
                                        (0.00013)       (0.00012)       (0.00012)       (0.00012) 
>       (0.00012)   

S upper 25%=0 # Ma~q                                      0.00000                                 
>                   
                                                              (.)                                 
>                   

S upper 25%=1 # Ma~q                                      0.01377***                              
>                   
                                                        (0.00518)                                 
>                   

S upper 10%=0 # Ma~q                                                      0.00000                 
>                   
                                                                              (.)                 
>                   

S upper 10%=1 # Ma~q                                                      0.00186                 
>                   
                                                                        (0.00776)                 
>                   

S upper 5%=0 # Mar~u                                                                      0.00000 
>                   
                                                                                              (.) 
>                   

S upper 5%=1 # Mar~u                                                                     -0.10850*
> **                
                                                                                        (0.03308) 
>                   

C6: Shelter in Pla~r                                                                              
>         0.04907*  
                                                                                                  
>       (0.02613)   

Days                                                                                              
>        -0.00055   
                                                                                                  
>       (0.00065)   

Constant                  1.37724***      1.14927***      1.45928***      1.45403***      1.45549*
> **      1.34074***
                        (0.02616)       (0.15211)       (0.03365)       (0.03340)       (0.03411) 
>       (0.06409)   
--------------------------------------------------------------------------------------------------
> ------------------
Observations                  714             714             714             714             714 
>             714   
--------------------------------------------------------------------------------------------------
> ------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. esttab using "./TeX_files/Regressions_1.tex", replace b(5) se(5) nomtitle label star(* 0.10 ** 0
> .05 *** 0.01) booktabs title("Regression Results \label{reg1}") addnotes("First line" "Second li
> ne")
(output written to ./TeX_files/Regressions_1.tex)

. est clear

. 
. eststo: newey cssd r_m_abs r_m_sqr, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  2,       711) =      34.31
                                                Prob > F          =     0.0000

------------------------------------------------------------------------------
             |             Newey–West
        cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     r_m_abs |   .0085874   .0019761     4.35   0.000     .0047077    .0124671
     r_m_sqr |   -.000286   .0002895    -0.99   0.324    -.0008544    .0002824
       _cons |   .1210189   .0023109    52.37   0.000      .116482    .1255559
------------------------------------------------------------------------------
(est1 stored)

. eststo: newey cssd r_m_abs r_m_sqr stringencyindex_weightedaverage populationvaccinated rolling_
> deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      31.79
                                                Prob > F          =     0.0000

-------------------------------------------------------------------------------------------------
                                |             Newey–West
                           cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------------+----------------------------------------------------------------
                        r_m_abs |   .0084602   .0018759     4.51   0.000     .0047771    .0121432
                        r_m_sqr |  -.0003526   .0002798    -1.26   0.208     -.000902    .0001967
stringencyindex_weightedaverage |   .0448998    .016342     2.75   0.006     .0128151    .0769845
           populationvaccinated |  -.0001429   .0000408    -3.51   0.000    -.0002229   -.0000629
                 rolling_deaths |  -.0000274   9.54e-06    -2.87   0.004    -.0000461   -8.62e-06
                          _cons |   .0958096   .0117348     8.16   0.000     .0727704    .1188488
-------------------------------------------------------------------------------------------------
(est2 stored)

. eststo: newey cssd r_m_abs r_m_sqr c.r_m_sqr#D25Upper populationvaccinated rolling_deaths, lag(5
> )

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      38.53
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |    .007529   .0019633     3.83   0.000     .0036743    .0113836
             r_m_sqr |   -.000362    .000265    -1.37   0.172    -.0008822    .0001582
                     |
  D25Upper#c.r_m_sqr |
                  1  |   .0006771   .0003693     1.83   0.067     -.000048    .0014022
                     |
populationvaccinated |  -.0001348   .0000415    -3.25   0.001    -.0002163   -.0000533
      rolling_deaths |  -.0000381   9.30e-06    -4.10   0.000    -.0000564   -.0000199
               _cons |   .1283924   .0027319    47.00   0.000     .1230287     .133756
--------------------------------------------------------------------------------------
(est3 stored)

. eststo: newey cssd r_m_abs r_m_sqr c.r_m_sqr#D10Upper populationvaccinated rolling_deaths, lag(5
> )

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      26.05
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .0084419   .0019008     4.44   0.000       .00471    .0121738
             r_m_sqr |   -.000299   .0002807    -1.07   0.287    -.0008501     .000252
                     |
  D10Upper#c.r_m_sqr |
                  1  |   .0000268   .0005394     0.05   0.960    -.0010322    .0010859
                     |
populationvaccinated |  -.0001373   .0000415    -3.31   0.001    -.0002188   -.0000559
      rolling_deaths |  -.0000388   9.33e-06    -4.16   0.000    -.0000571   -.0000205
               _cons |   .1281034   .0027161    47.16   0.000     .1227708    .1334359
--------------------------------------------------------------------------------------
(est4 stored)

. eststo: newey cssd r_m_abs r_m_sqr c.r_m_sqr#D5Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      27.98
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .0091551   .0018598     4.92   0.000     .0055038    .0128064
             r_m_sqr |  -.0003918   .0002783    -1.41   0.160    -.0009381    .0001545
                     |
   D5Upper#c.r_m_sqr |
                  1  |  -.0068814   .0017972    -3.83   0.000    -.0104098   -.0033529
                     |
populationvaccinated |  -.0001441   .0000417    -3.45   0.001     -.000226   -.0000622
      rolling_deaths |  -.0000392   9.37e-06    -4.18   0.000    -.0000576   -.0000208
               _cons |   .1282398   .0027376    46.84   0.000      .122865    .1336146
--------------------------------------------------------------------------------------
(est5 stored)

. eststo: newey cssd r_m_abs r_m_sqr c6e_stayathomerequirements days populationvaccinated rolling_
> deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  6,       707) =      25.78
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                           |             Newey–West
                      cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   r_m_abs |   .0085374   .0018815     4.54   0.000     .0048433    .0122314
                   r_m_sqr |  -.0003741   .0002821    -1.33   0.185     -.000928    .0001797
c6e_stayathomerequirements |   .0057105   .0020229     2.82   0.005     .0017389    .0096822
                      days |  -.0000772   .0000508    -1.52   0.129    -.0001769    .0000224
      populationvaccinated |  -.0001146   .0000469    -2.44   0.015    -.0002067   -.0000225
            rolling_deaths |  -.0000288   9.46e-06    -3.04   0.002    -.0000473   -.0000102
                     _cons |   .1152724   .0050321    22.91   0.000     .1053929     .125152
--------------------------------------------------------------------------------------------
(est6 stored)

. 
. esttab, b(5) se(5) nomtitle label star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------------------------------------------------------------
> ------------------
                              (1)             (2)             (3)             (4)             (5) 
>             (6)   
--------------------------------------------------------------------------------------------------
> ------------------
Absolute Market Re~n      0.00859***      0.00846***      0.00753***      0.00844***      0.00916*
> **      0.00854***
                        (0.00198)       (0.00188)       (0.00196)       (0.00190)       (0.00186) 
>       (0.00188)   

Market Return Squa~d     -0.00029        -0.00035        -0.00036        -0.00030        -0.00039 
>        -0.00037   
                        (0.00029)       (0.00028)       (0.00026)       (0.00028)       (0.00028) 
>       (0.00028)   

Stringency Index                          0.04490***                                              
>                   
                                        (0.01634)                                                 
>                   

Vaccination Rate                         -0.00014***     -0.00013***     -0.00014***     -0.00014*
> **     -0.00011** 
                                        (0.00004)       (0.00004)       (0.00004)       (0.00004) 
>       (0.00005)   

COVID-19 Deaths 7-~v                     -0.00003***     -0.00004***     -0.00004***     -0.00004*
> **     -0.00003***
                                        (0.00001)       (0.00001)       (0.00001)       (0.00001) 
>       (0.00001)   

S upper 25%=0 # Ma~q                                      0.00000                                 
>                   
                                                              (.)                                 
>                   

S upper 25%=1 # Ma~q                                      0.00068*                                
>                   
                                                        (0.00037)                                 
>                   

S upper 10%=0 # Ma~q                                                      0.00000                 
>                   
                                                                              (.)                 
>                   

S upper 10%=1 # Ma~q                                                      0.00003                 
>                   
                                                                        (0.00054)                 
>                   

S upper 5%=0 # Mar~u                                                                      0.00000 
>                   
                                                                                              (.) 
>                   

S upper 5%=1 # Mar~u                                                                     -0.00688*
> **                
                                                                                        (0.00180) 
>                   

C6: Shelter in Pla~r                                                                              
>         0.00571***
                                                                                                  
>       (0.00202)   

Days                                                                                              
>        -0.00008   
                                                                                                  
>       (0.00005)   

Constant                  0.12102***      0.09581***      0.12839***      0.12810***      0.12824*
> **      0.11527***
                        (0.00231)       (0.01173)       (0.00273)       (0.00272)       (0.00274) 
>       (0.00503)   
--------------------------------------------------------------------------------------------------
> ------------------
Observations                  714             714             714             714             714 
>             714   
--------------------------------------------------------------------------------------------------
> ------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. esttab using "./TeX_files/Regressions_2.tex", replace b(5) se(5) nomtitle label star(* 0.10 ** 0
> .05 *** 0.01) booktabs title("Robustness Results \label{reg2}") addnotes("First line" "Second li
> ne")
(output written to ./TeX_files/Regressions_2.tex)

. est clear

. 
. // Robustness Checks //
. eststo: newey csad r_m_abs r_m_sqr c6e_stayathomerequirements populationvaccinated rolling_death
> s, lag(5)

Regression with Newey–West standard errors      Number of obs     =        714
Maximum lag = 5                                 F(  5,       708) =      30.32
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                           |             Newey–West
                      csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   r_m_abs |   .1826838   .0244892     7.46   0.000     .1346036     .230764
                   r_m_sqr |  -.0098233   .0048036    -2.04   0.041    -.0192543   -.0003922
c6e_stayathomerequirements |   .0375966   .0205828     1.83   0.068    -.0028141    .0780072
      populationvaccinated |  -.0015197   .0005332    -2.85   0.004    -.0025666   -.0004729
            rolling_deaths |  -.0003314   .0001175    -2.82   0.005    -.0005621   -.0001006
                     _cons |   1.358369   .0582112    23.34   0.000     1.244082    1.472656
--------------------------------------------------------------------------------------------
(est1 stored)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-
> of-Bristol---AED\section_3-2.log
  log type:  text
 closed on:  24 Mar 2023, 20:22:00
--------------------------------------------------------------------------------------------------
