-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\data\secti
> on_3-2.log
  log type:  text
 opened on:  19 Mar 2023, 15:16:19

. 
. cd "C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\data"
C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\data

. 
. import delimited "spec_1.csv"
(encoding automatically selected: ISO-8859-1)
(15 vars, 733 obs)

. 
. replace stringencyindex_weightedaverage = 0 if missing(stringencyindex_weightedaverage) 
(0 real changes made)

. 
. gen r_m_sqr=r_m^2

. gen r_m_abs=abs(r_m)

. replace stringencyindex_weightedaverage=stringencyindex_weightedaverage/100
(714 real changes made)

. 
. la var r_m "Market Return"

. la var stringencyindex_weightedaverage "Stringency Index"

. la var c6e_stayathomerequirements "Shelter in Place Indicator"

. la var populationvaccinated "Vaccination Rate"

. la var rolling_deaths "COVID-19 Deaths 7-Day Rolling Average"

. la var cases "COVID-19 Daily Cases"

. la var r_m_sqr "Market Return Squared"

. la var r_m_abs "Absolute Market Return"

. 
. sort date

. gen time=_n

. drop if time==1
(1 observation deleted)

. 
. 
. tempvar PL75

. egen `PL75' = pctile(stringencyindex_weightedaverage), p(75)

. gen D25Upper = 0

. label var D25Upper "Dummy variable = 1 if stringency fall within upper 25%"

. replace D25Upper = 1 if stringencyindex_weightedaverage >= `PL75'
(295 real changes made)

. 
. tempvar PL90

. egen `PL90' = pctile(stringencyindex_weightedaverage), p(90)

. gen D10Upper = 0

. label var D10Upper "Dummy variable = 1 if stringency fall within upper 10%"

. replace D10Upper = 1 if stringencyindex_weightedaverage >= `PL90'
(158 real changes made)

. 
. tempvar PL95

. egen `PL95' = pctile(stringencyindex_weightedaverage), p(95)

. gen D5Upper = 0

. label var D5Upper "Dummy variable = 1 if stringency fall within upper 5%"

. replace D5Upper = 1 if stringencyindex_weightedaverage >= `PL95'
(46 real changes made)

. 
. 
. tsset time

Time variable: time, 2 to 733
        Delta: 1 unit

. 
. estpost sum r_m - r_m_abs

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min)     e(max)     e(sum) 
-------------+----------------------------------------------------------------------------------------
         r_m |       732        732  -.0205091   1.520264    1.23299  -8.977271   5.395286  -15.01269 
        csad |       732        732   1.516546   .1293076   .3595937   .7320971    2.92287   1110.111 
        cssd |       732        732   .1275852    .000829   .0287925   .0592159     .25052   93.39233 
stringency~e |       732        732   .6982656   .0200903   .1417401          0      .8194   511.1304 
c6e_stayat~s |       732        732   2.419399   .9223591   .9603953          0          3       1771 
population~d |       732        732   39.16296   1783.117   42.22697          0      89.35   28667.29 
c2e_workpl~g |       732        732   2.530055   .5066194    .711772          0          3       1852 
c3e_cancel~s |       732        732   1.930328   .1141542   .3378671          0          2       1413 
c4e_restri~s |       732        732   3.831967   .4765143   .6903002          0          4       2805 
c5e_closep~t |       732        732   1.240437   .7355445   .8576389          0          2        908 
c7e_restri~e |       732        732   1.721311   .3380951   .5814595          0          2       1260 
c8e_intern~s |       732        732   2.349727    .490383   .7002735          0          3       1720 
rolling_de~s |       732        732   60.86924   84748.16   291.1154          0       3964   44556.29 
       cases |       732        732   90458.27   3.53e+11   593912.8          0    6966046   6.62e+07 
     r_m_sqr |       732        732   1.518607    17.3855   4.169592   1.29e-06   80.59139   1111.621 
     r_m_abs |       732        732   .8705231   .7618377   .8728331   .0011353   8.977271   637.2229 

. 
. quietly reg csad r_m_abs r_m_sqr stringencyindex_weightedaverage populationvaccinated rolling_deaths

. estat bgodfrey, lags(1 2:30)

Breusch–Godfrey LM test for autocorrelation
---------------------------------------------------------------------------
    lags(p)  |          chi2               df                 Prob > chi2
-------------+-------------------------------------------------------------
       1     |        225.698               1                   0.0000
       2     |        276.565               2                   0.0000
       3     |        284.194               3                   0.0000
       4     |        289.248               4                   0.0000
       5     |        291.777               5                   0.0000
       6     |        291.972               6                   0.0000
       7     |        292.245               7                   0.0000
       8     |        294.001               8                   0.0000
       9     |        294.202               9                   0.0000
      10     |        298.130              10                   0.0000
      11     |        298.184              11                   0.0000
      12     |        298.204              12                   0.0000
      13     |        298.259              13                   0.0000
      14     |        299.466              14                   0.0000
      15     |        299.914              15                   0.0000
      16     |        300.080              16                   0.0000
      17     |        300.287              17                   0.0000
      18     |        300.347              18                   0.0000
      19     |        300.898              19                   0.0000
      20     |        302.769              20                   0.0000
      21     |        302.771              21                   0.0000
      22     |        302.801              22                   0.0000
      23     |        303.776              23                   0.0000
      24     |        303.780              24                   0.0000
      25     |        304.005              25                   0.0000
      26     |        309.245              26                   0.0000
      27     |        309.297              27                   0.0000
      28     |        310.046              28                   0.0000
      29     |        310.918              29                   0.0000
      30     |        311.020              30                   0.0000
---------------------------------------------------------------------------
                        H0: no serial correlation

. 
. dfuller csad

Dickey–Fuller test for unit root          Number of obs  = 731
Variable: csad                            Number of lags =   0

H0: Random walk without drift, d = 0

                                       Dickey–Fuller
                   Test      -------- critical value ---------
              statistic           1%           5%          10%
--------------------------------------------------------------
 Z(t)           -12.764       -3.430       -2.860       -2.570
--------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000.

. 
. newey cssd r_m_abs r_m_sqr stringencyindex_weightedaverage populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      26.34
                                                Prob > F          =     0.0000

-------------------------------------------------------------------------------------------------
                                |             Newey–West
                           cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------------+----------------------------------------------------------------
                        r_m_abs |   .0084072   .0018367     4.58   0.000     .0048013    .0120131
                        r_m_sqr |  -.0003743   .0002693    -1.39   0.165    -.0009029    .0001543
stringencyindex_weightedaverage |   .0414164     .00833     4.97   0.000     .0250625    .0577702
           populationvaccinated |  -.0001658    .000039    -4.25   0.000    -.0002424   -.0000892
                 rolling_deaths |   2.67e-06   3.10e-06     0.86   0.388    -3.41e-06    8.75e-06
                          _cons |   .0982468   .0056149    17.50   0.000     .0872234    .1092702
-------------------------------------------------------------------------------------------------

. 
. newey cssd r_m_abs r_m_sqr c.r_m_sqr#D25Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      26.67
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .0075311   .0019507     3.86   0.000     .0037013    .0113608
             r_m_sqr |  -.0004105   .0002776    -1.48   0.140    -.0009554    .0001344
                     |
  D25Upper#c.r_m_sqr |
                  1  |   .0007977   .0003638     2.19   0.029     .0000835    .0015119
                     |
populationvaccinated |  -.0001468   .0000398    -3.69   0.000     -.000225   -.0000686
      rolling_deaths |  -6.23e-06   2.93e-06    -2.13   0.034     -.000012   -4.85e-07
               _cons |   .1272204   .0027241    46.70   0.000     .1218724    .1325684
--------------------------------------------------------------------------------------

. newey cssd r_m_abs r_m_sqr c.r_m_sqr#D10Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      22.23
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .0085475   .0018818     4.54   0.000      .004853     .012242
             r_m_sqr |  -.0003368   .0002681    -1.26   0.209    -.0008633    .0001896
                     |
  D10Upper#c.r_m_sqr |
                  1  |   .0000828   .0005347     0.15   0.877     -.000967    .0011325
                     |
populationvaccinated |  -.0001503   .0000398    -3.78   0.000    -.0002284   -.0000723
      rolling_deaths |  -6.32e-06   2.97e-06    -2.13   0.034    -.0000121   -4.91e-07
               _cons |   .1268956   .0027098    46.83   0.000     .1215756    .1322156
--------------------------------------------------------------------------------------

. newey cssd r_m_abs r_m_sqr c.r_m_sqr#D5Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      23.33
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                cssd | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .0092783   .0018424     5.04   0.000     .0056613    .0128952
             r_m_sqr |  -.0004233   .0002691    -1.57   0.116    -.0009516    .0001049
                     |
   D5Upper#c.r_m_sqr |
                  1  |  -.0066579   .0017648    -3.77   0.000    -.0101225   -.0031933
                     |
populationvaccinated |  -.0001568   .0000401    -3.91   0.000    -.0002355   -.0000781
      rolling_deaths |  -6.34e-06   2.99e-06    -2.12   0.034    -.0000122   -4.71e-07
               _cons |   .1269856   .0027368    46.40   0.000     .1216125    .1323586
--------------------------------------------------------------------------------------

. 
. newey csad r_m_abs r_m_sqr stringencyindex_weightedaverage populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      28.72
                                                Prob > F          =     0.0000

-------------------------------------------------------------------------------------------------
                                |             Newey–West
                           csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------------------------+----------------------------------------------------------------
                        r_m_abs |   .1814921   .0238801     7.60   0.000     .1346098    .2283743
                        r_m_sqr |  -.0102624   .0045078    -2.28   0.023    -.0191123   -.0014124
stringencyindex_weightedaverage |   .4540178   .1079195     4.21   0.000     .2421462    .6658894
           populationvaccinated |  -.0017465   .0005114    -3.42   0.001    -.0027506   -.0007425
                 rolling_deaths |   .0000178    .000037     0.48   0.631    -.0000549    .0000905
                          _cons |   1.124429   .0713373    15.76   0.000     .9843765    1.264481
-------------------------------------------------------------------------------------------------

. 
. newey csad r_m_abs r_m_sqr c.r_m_sqr#D25Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      51.44
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .1631959   .0237664     6.87   0.000     .1165367     .209855
             r_m_sqr |  -.0112793   .0032223    -3.50   0.000    -.0176055   -.0049532
                     |
  D25Upper#c.r_m_sqr |
                  1  |   .0151334    .005083     2.98   0.003     .0051543    .0251126
                     |
populationvaccinated |  -.0015114   .0005107    -2.96   0.003     -.002514   -.0005089
      rolling_deaths |   -.000079   .0000327    -2.42   0.016    -.0001431   -.0000148
               _cons |   1.444957   .0333305    43.35   0.000     1.379521    1.510393
--------------------------------------------------------------------------------------

. newey csad r_m_abs r_m_sqr c.r_m_sqr#D10Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      26.64
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .1816494   .0242269     7.50   0.000     .1340863    .2292126
             r_m_sqr |  -.0099287   .0043588    -2.28   0.023    -.0184861   -.0013714
                     |
  D10Upper#c.r_m_sqr |
                  1  |   .0025682   .0076866     0.33   0.738    -.0125224    .0176588
                     |
populationvaccinated |    -.00158   .0005113    -3.09   0.002    -.0025838   -.0005762
      rolling_deaths |  -.0000806   .0000335    -2.41   0.016    -.0001463   -.0000148
               _cons |   1.439261   .0331323    43.44   0.000     1.374215    1.504308
--------------------------------------------------------------------------------------

. newey csad r_m_abs r_m_sqr c.r_m_sqr#D5Upper populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      27.98
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------
                     |             Newey–West
                csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
             r_m_abs |   .1943675   .0238459     8.15   0.000     .1475523    .2411827
             r_m_sqr |   -.011254   .0044035    -2.56   0.011    -.0198992   -.0026088
                     |
   D5Upper#c.r_m_sqr |
                  1  |  -.1064428   .0322489    -3.30   0.001    -.1697551   -.0431305
                     |
populationvaccinated |  -.0016804   .0005145    -3.27   0.001    -.0026904   -.0006703
      rolling_deaths |   -.000081   .0000339    -2.39   0.017    -.0001475   -.0000145
               _cons |   1.440117   .0339131    42.46   0.000     1.373538    1.506697
--------------------------------------------------------------------------------------

. 
. newey csad r_m_abs r_m_sqr c6e_stayathomerequirements populationvaccinated rolling_deaths, lag(5)

Regression with Newey–West standard errors      Number of obs     =        732
Maximum lag = 5                                 F(  5,       726) =      30.80
                                                Prob > F          =     0.0000

--------------------------------------------------------------------------------------------
                           |             Newey–West
                      csad | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
                   r_m_abs |   .1837871   .0242459     7.58   0.000     .1361867    .2313875
                   r_m_sqr |  -.0101993   .0046585    -2.19   0.029    -.0193451   -.0010535
c6e_stayathomerequirements |   .0574984   .0194221     2.96   0.003     .0193683    .0956285
      populationvaccinated |  -.0016591   .0005028    -3.30   0.001    -.0026462    -.000672
            rolling_deaths |  -.0000231   .0000269    -0.86   0.390    -.0000759    .0000296
                     _cons |   1.299315   .0536884    24.20   0.000     1.193912    1.404718
--------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\whisk\OneDrive\Documents\Bristol\Economics\Year 4\AED\AED GitHub\University-of-Bristol---AED\data\secti
> on_3-2.log
  log type:  text
 closed on:  19 Mar 2023, 15:16:20
-----------------------------------------------------------------------------------------------------------------------------
